bench-new/orchestrator/app/controllers/runs_controller.rb

  def create
    instance_types = parse_instance_types(params)

    if instance_types.empty?
      render json: { error: "At least one instance type must be specified" }, status: :bad_request
      return
    end

    @run = Run.new(
      ruby_version: params[:ruby_version],
      runs_per_instance_type: params[:runs_per_instance_type],
      external_id: params[:run_id]
    )

    if @run.save
---
INSERT INTO "runs" ("created_at", "external_id", "gzip_url", "ruby_version", "runs_per_instance_type", "status", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def show
    @run = find_run

    unless @run
      render json: { error: "Run not found" }, status: :not_found
      return
    end

    @tasks_by_status = @run.tasks.group(:status).count
---
SELECT COUNT(*) AS "count_all", "tasks"."status" AS "tasks_status" FROM "tasks" WHERE "tasks"."run_id" = $1 GROUP BY "tasks"."status"  [["run_id", 10]]