bench-new/orchestrator/app/controllers/tasks_controller.rb

  def claim
    unless params[:provider].present? && params[:instance_type].present? && params[:runner_id].present?
      render json: { error: 'Missing required parameters' }, status: :bad_request
      return
    end

    @run = find_run

    unless @run
      render json: { error: 'Run not found' }, status: :not_found
      return
    end

    unless @run.running?
      @status = "done"
      @message = "Run is not running"
      return
    end

    ActiveRecord::Base.transaction do
      @task = @run.tasks
        .for_provider_and_type(params[:provider], params[:instance_type])
        .pending
        .lock
        .first

      if @task.nil?
        in_progress = @run.tasks
          .for_provider_and_type(params[:provider], params[:instance_type])
          .where(status: ['claimed', 'running'])
          .exists?
---
SELECT "runs".* FROM "runs" WHERE "runs"."status" = $1 ORDER BY "runs"."created_at" DESC LIMIT $2  [["status", "running"], ["LIMIT", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."run_id" = $1 AND "tasks"."provider" = $2 AND "tasks"."instance_type" = $3 AND "tasks"."status" = $4 ORDER BY "tasks"."id" ASC LIMIT $5 FOR UPDATE  [["run_id", 19], ["provider", "aws"], ["instance_type", "c8g.medium"], ["status", "pending"], ["LIMIT", 1]]
SELECT 1 AS one FROM "tasks" WHERE "tasks"."run_id" = $1 AND "tasks"."provider" = $2 AND "tasks"."instance_type" = $3 AND "tasks"."status" IN ($4, $5) LIMIT $6  [["run_id", 19], ["provider", "aws"], ["instance_type", "c8g.medium"], ["status", "claimed"], ["status", "running"], ["LIMIT", 1]]

  def heartbeat
    @task = Task.find(params[:id])

    unless params[:runner_id] == @task.runner_id
      render json: { error: 'Invalid runner_id' }, status: :forbidden
      return
    end

    unless params[:status].present?
      render json: { error: 'Missing status parameter' }, status: :bad_request
      return
    end

    @task.update_heartbeat!(
      heartbeat_status: params[:status],
      current_benchmark: params[:current_benchmark],
      progress_pct: params[:progress_pct],
      message: params[:message]
    )
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "tasks" SET "current_benchmark" = $1, "heartbeat_at" = $2, "heartbeat_message" = $3, "heartbeat_status" = $4, "progress_pct" = $5, "status" = $6, "updated_at" = $7 WHERE "tasks"."id" = $8

  def complete
    @task = Task.find(params[:id])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def fail
    @task = Task.find(params[:id])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def find_run
    run_id = params[:run_id] || params[:id]
    Run.find_by(external_id: run_id) || Run.find_by(id: run_id)
---
SELECT "runs".* FROM "runs" WHERE "runs"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]